print('--------------------------------------------------集合的定义--------------------------------------------')
'''
集合用set{}表示
如果{}表示字典
无序
并且不允许重复
'''
# 方式1
set1 = {1, 2, 3}

# 方式2
set2 = set('abcde')  # 也可以是列表
print(set2)

# 空集合      注意：{}是空字典
set3 = set()

print('--------------------------------------------------集合的去重--------------------------------------------')

# 去重
set4 = {1, 1, 2, 2, 3, 3, 4}
print(set4)

# 因为set()不允许重复
# 所以可以用set()给列表、元组、字符串去重，然后再转化为列表、元组、字符串
list1 = [1, 1, 2, 2, 3]
list2 = list(set(list1))
print(list2)

# in not in
s = {1, 2, 3}
print(2 in s)

print('--------------------------------------------------集合的方法--------------------------------------------')

# add  # 当作一个
set11 = {1, 2, 3, 4}
set11.add(5)
set11.add((6, 7))
print(set11)

# update  # 当作多个
set11.update('8')
set11.update([9, 10])
set11.update((11, 12))
print(set11)

# remove
set2 = {1, 2, 3, 4, 5}
set2.remove(3)
print(set2)

# pop  # 删除最后一个，但集合无序，不知道会删除哪个，所以要慎用
set2.pop()
print(set2)

# clear
set3.clear()
print(set3)  # 显示空集合 set()

print('--------------------------------------------------集合的排序--哈哈------------------------------------------')
s = {2, 0, -3, 5}
print(sorted(s))
