print('-----------------------------------------------元组的定义-------------------------------------------------')

# 方式1
tuple1 = (1, 2, 3, 4)

# 方式2
# 把字符串转化为元组
tuple2 = tuple('abcde')
print(tuple2)


print('-----------------------------------------------元组的特性-------------------------------------------------')

# 不加括号，默认是元组
a = 1, 2
print(type(a))

# 如果元组只有一个元素，也需要加逗号
b = 1      # int
c = 1,     # tuple
d = (1,)   # tuple
print(type(b), type(c), type(d))

print('-----------------------------------------------元组转化为字符串-------------------------------------------')

# 把元组转化为字符串，跟列表转化为字符串一样，也是用''.join()函数
tuple3 = ('a', 'b', 'c')
s = ''.join(tuple3)
print(s)

print('-----------------------------------------------元组的拼接-------------------------------------------')

tuple4 = (1, 2, 3, 4)
tuple5 = (5, 6, 7)
tuple6 = tuple4 + tuple5
print(tuple6)

print('-----------------------------------------------元组的索引-------------------------------------------')

# 列表的索引，和字符串的索引不完全一样，因为可以通过索引来修改列表
# 元组的索引，和字符串的索引完全一样，因为字符串和元组都是不可修改的
tuple7 = tuple('hello')
print(tuple7[0])
print(tuple7[-1])
print(tuple7[:])
print(tuple7[::])
print(tuple7[::2])
print(tuple7[::-1])  # 反转
print(tuple7[4:1:-1])
print(tuple7[-1:-4:-1])
print(tuple7[4:1:1])

print('-----------------------------------------------元组的排序-------------------------------------------')

# 使用sorted()
tuple9 = (3, 1, 0, -4, 6)
print(sorted(tuple9))  # 排序后是个列表，并且不会改变原来的元组
print(tuple9)

print('-----------------------------------------------元组的方法-------------------------------------------')

# max min sum
tuple8 = (1, 2, 3)
print(max(tuple8))
print(min(tuple8))
print(sum(tuple8))

# count
tuple10 = ('a', 'b', 'c', 'a', 'e')
print(tuple10.count('a'))

# index
print(tuple10.index('f'))  # 返回第一个匹配的索引，如果不存在则报错

'''
备注：
字符串有index和find方法，列表和元组只有index
index如果找不到会报错，find找不到返回-1
'''