import keyword

print('----------------------------------------------变量赋值的3种方式--------------------------------------------')

# 传统赋值
name = 'jerry'

# 链式赋值
name1 = name2 = 'tom'

# 序列解包赋值
name3, age = 'jerry', 18

print('--------------------查看变量的类型------type------isinstance()-------------------------------------')

# type()
s = '999'
print(type(s))

# isinstance()
if isinstance(s, str):
    print(True)
else:
    print(False)

# 判断是否可迭代
from collections.abc import Iterable
ll = [1, 2, 3]
if isinstance(ll, Iterable):
    print(True)
else:
    print(False)

print('----------------------------------------------查看地址--------------------------------------------')

name4 = 'Tom'
user = 'Tom'
print(id(name4))
print(id(user))

print('----------------------------------------------变量的地址------------------------------------------')
# 3个列表，地址都不一样
# a = [1, 2, 3]
# b = [1, 2, 3]
# c = [1, 2, 3]

# 2个列表，地址一样
# a = b = c= [1, 2, 3]  # id相等

# 3个字典，地址都不一样
# a = {'name': 'jerry', 'age': 18}
# b = {'name': 'jerry', 'age': 18}
# c = {'name': 'jerry', 'age': 18}

# 3个集合，地址都不一样
# a = {1, 2, 3}
# b = {1, 2, 3}
# c = {1, 2, 3}

# 3个元组，地址一样
# a = (1, 2, 3)
# b = (1, 2, 3)
# c = (1, 2, 3)

# 3个字符串，地址一样
# a = 'jerry'
# b = 'jerry'
# c = 'jerry'

# 3个数字，地址一样
a = 1
b = 1
c = 1

print('------------------------------------------------变量的地址2------------------------------------------')
# 列表 --- a和b的id一样，和c不一样
# a = [1, 2, 3]
# b = a
# c = a.copy()

# 字典 --- a和b的id一样，和c不一样
# a = {'name': 'jerry', 'age': 18}
# b = a
# c = a.copy()

# 集合 --- a和b的id一样，和c不一样
# a = {'name', 'age'}
# b = a
# c = a.copy()

# 元组 --- a和b的id一样
# a = (1, 2, 3)
# b = a

# 字符串 --- a和b的id一样
# a = 'name'
# b = a

# 数字 --- a和b的id一样
a1 = 10
b1 = a

print('----------------------------------------------is is not--------------------------------------------')

# (a is b) is true only when id(a) == id(b)

print('----------------------------------------------变量的命名--------------------------------------------')

# 推荐命名方法，名字要有意义
student_name_list = ['Tom', 'Jerry', 'Lucy']

# 变量名不要使用关键字
# 关键字列表
print(keyword.kwlist)
