# 把str中的标点符号去掉，且把不合法的ip去掉，然后按照ip的最后一位进行排序

import re
s = '192.168.0.25, 192.168.0.18    130.168.210.33? 192.168.0.2" 192.168.0.23! 98.12.13.1: 192.168.0.1;'

#  \w     匹配数字字母下划线
#  \W     匹配非数字字母下划线
#  [^abc] 匹配除了a,b,c之外的字符
# re.sub()用于替换字符串中的匹配项

s = re.sub(r'[^\w.]', ' ', s)  # 把s中除了数字字母下划线之外的(即：标点符号)都替换为空格
print(s)

l = s.split()  # 以空格分隔，生成的是一个列表
print(l)

# 去除不合法的ip
l2 = []
for i in l:
    if i.startswith('192'):
        l2.append(i)
print(l2)

# 按照ip最后一位排序
l2.sort(key=lambda x: int(x.split('.')[3]))  # 如果不转化为int，则会按照1,18,2,23,25这样排序
print(l2)
